README.md

# Table of Contents

1.  [Grind 75](#org374d33c)

Collection of my solutions to LeetCode problems


<a id="org374d33c"></a>

# Grind 75

Grind 75 is a collection of 75 LeetCode problems written by the same author of the Blind 75. The main difference is that this one offers an ordered list to practice.
In this repository, I have my solutions to these problems, as well as some notes about them.
Currently I have solved: 10 / 75

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">LeetCode Name &amp; Number</th>
<th scope="col" class="org-left">Theme</th>
<th scope="col" class="org-left">Difficulty</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">[Two Sum](<a href="https://github.com/racoelhosilva/LeetCode/blob/master/Grind75/ArraysHashing/TwoSum.cpp">https://github.com/racoelhosilva/LeetCode/blob/master/Grind75/ArraysHashing/TwoSum.cpp</a>)</td>
<td class="org-left">Arrays &amp; Hashing</td>
<td class="org-left">Easy</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

